import pdfMake from "pdfmake/build/pdfmake";
import pdfFonts from "pdfmake/build/vfs_fonts";

// Перевод для функционального компонента
import { useTranslation } from "react-i18next";

pdfMake.vfs = pdfFonts.pdfMake.vfs;
pdfMake.fonts = {
  TimesNewRoman: {
    normal: 'TimesNewRoman.ttf',
    bold: 'TimesNewRomanBold.ttf',
    italics: 'TimesNewRomanItalics.ttf',
    bolditalics: 'TimesNewRomanBoldItalics.ttf'
  },
  emptyCheckbox: {
    normal: 'emptyCheckbox.ttf'
  }
}

const InsuranceApplicationDocument = (props) => {
  // Translation
  const { t } = useTranslation()
  
  const gender = () => {
    if(props.iin) {
      if ((+props.iin[6]) % 2 === 1) {
        return 'М'
      } else {
        return 'Ж'
      }
    }
  }

  let insuranceApplication = {
    content: [
      {
        text: 'САҚТАНДЫРУ ТУРАЛЫ ӨТІНІШ / ЗАЯВЛЕНИЕ НА СТРАХОВАНИЕ',
        style: 'bold8',
        alignment: 'center'
      },
      {
        text: ' ',
        style: 'regular9'
      },
      {
        text: [
          'Агент: ',
          {
            text: 'МФО “i-credit.kz”',
            style: 'bold8'
          }
        ],
        fontSize: 8
      },
      {
        text: ' ',
        style: 'regular9'
      },
      {
        text: 'Сақтандырылушы болып табылатын Сақтанушы туралы мәліметтер',
        style: 'boldItalics11',
        alignment: 'center'
      },
      {
        text: '/Сведения о Страхователе, являющимся Застрахованным',
        style: 'boldItalics11',
        alignment: 'center'
      },
      {
        text: `Т.А.Ә./Ф.И.О. ${props.fio}`,
        style: 'regular9'
      },
      {
        text: `Туған күні /Дата рождения ${props.dateOfBirth} Жынысы /Пол ${gender()}`,
        style: 'regular9'
      },
      {
        text: `Тұратын жері /Место проживания: ${props.address}`,
        style: 'regular9'
      },
      {
        text: 'Телефон нөмірі/Номер телефона: үй /дом. - жұм/раб. -',
        style: 'regular9'
      },
      {
        text: `Ұялы телефон /Мобильный телефон +${props.phone}`,
        style: 'regular9'
      },
      {
        text: `e-mail ${props.email}`,
        style: 'regular9'
      },
      {
        text: `Жұмыс орны /Место работы ${props.placeOfWork} /Должность ${props.position}`,
        style: 'regular9'
      },
      {
        text: `Экономика секторының коды/Код сектора экономики 19  ЖСН /ИИН ${props.iin}                      Резидент V   Нерезидент`,
        style: 'regular9'
      },
      {
        text: 'Ел /Страна Казахстан Азаматтық/Гражданство Казахстан',
        style: 'regular9'
      },
      {
        text: 'Егер де Сақтанушы/Сақтандырылушы АҚШ тұрғыны немесе АҚШ азаматы болса, өтініштің косымшасын толтыру керек/ В случае если Страхователь/ Застрахованный является резидентом США или имеет гражданство США необходимо заполнить приложение к заявлению.',
        style: 'italics9'
      },
      {
        text: ' '
      },
      {
        text: `Жеке тұлғаны растайтын құжат (паспорт/жеке куәлігі/тұруға рұқсат қағазы)/ Документ, удостоверяющий личность (паспорт/ уд.личности/ вид на жительство) № ${props.cardNumber} от ${props.startCard}. Берілді/выдан сроком до ${props.endCard} г. дейін,Туған жер/Место рождения ${props.placeOfBirth}. Сақтанушы шет елдік танымал лауазымды тұлға болып табылады ма?/ Является ли Застрахованный иностранным публичным должностным лицом?`,
        style: 'regular9'
      },
      {
        text: ' ',
        style: 'icon'
      },
      {
        text: 'Шет елдік танымал лауазымды тұлға-шет елдің заңнамалық, атқарушылық, әкімшілік немесе сот органында қызмет атқаратын, тағайындалатын немесе сайланатын тұлға, сондай-ақ шет елге көпшілік қызмет атқаратын тұлға./Иностранное публичное должностное лицо - лицо, назначаемое или избираемое, занимающее какую-либо должность в законодательном, исполнительном, административном или судебном органе иностранного государства, а также любое лицо, выполняющее какую-либо публичную функцию для иностранного государства.',
        style: 'italics9'
      },
      {
        text: 'Сақтандыру қорғауының сипаты /Описание страховой защиты',
        style: 'boldItalics11',
        alignment: 'center'
      },
      {
        text: 'Түрі /Вид: Өмірді сақтандыру /Страхование жизни',
        style: 'regular9'
      },
      {
        text: `Сұралатын сақтандыру мерзімі (күн)/ Запрашиваемый срок страхования (дней) ${props.period}`,
        style: 'regular9'
      },
      {
        text: `Сұралатын сақтандыру сомасы (сандармен)/ Запрашиваемая страховая сумма (цифрами) ${props.insuranceAmount}`,
        style: 'regular9'
      },
      {
        text: 'Сақтандыру сыйлықақысын төлеу кезеңділігі /Периодичность оплаты страховой премии: Бір жолғы /Единовременно ',
        style: 'regular9'
      },
      {
        text: 'Пайда алушы /Выгодоприобретатель: Сақтандырылушының мұрагерлері /Наследники Застрахованного ',
        style: 'regular9'
      },
      {
        text: ' ',
        style: 'regular9'
      },
      {
        text: ' ',
        style: 'regular9'
      },
      {
        text: 'Мен/Я подтверждаю, что:',
        style: 'boldItalics10'
      },
      {
        ul: [
          {
            text:'мүгедек еместігімді (кез келген топ)/',
            style: 'regular9'
          },
          {
            text:'не являюсь инвалидом (любой группы);',
            style: 'regular9',
            listType: 'none'
          },
          {
            text:'психоневрологиялық диспансерде есепте тұрмайтынымды /',
            style: 'regular9'
          },
          {
            text:'не состою на учёте в психоневрологическом диспансере;',
            style: 'regular9',
            listType: 'none'
          },
          {
            text:'онкологиялық ауруымен, ауытқу ауруларымен, АИВ-инфекциясы немесе АИВ-инфекциясымен байланысты ауруларымен, жүрек-тамыр жүйесінің жүрек немесе тамыр жетімсіздігімен созылмалы ауруларымен, бүйрек немесе бауыр жетімсіздігімен созылмалы ауруларымен ауырмайтынымды растаймын./',
            alignment: 'justify',
            style: 'regular9'
          },
          {
            text:'не страдаю онкологическим заболеванием, психическими заболеваниями, заболеванием ВИЧ-инфекцией (СПИД) или заболеванием, связанным с ВИЧ-инфекцией (СПИД), хроническими заболеваниями сердечно-сосудистой системы, с сердечной или сосудистой недостаточностью, заболеваниями с хронической почечной или печеночной недостаточностями.',
            alignment: 'justify',
            style: 'regular9',
            listType: 'none'
          }
        ]
      },
      {
        text: ' '
      },
      {
        text: 'Шарттың ажырамас бөлігі болып табылатын, өтініште көрсетілген барлық мәліметтер шынайы екенін, және қандай да бір мәлімет жалған болған жағдайда ««Freedom Finance Life» Өмірді сақтандыру компаниясы» АҚ сақтандыру төлемін жүзеге асырудан бас тартуға құқылы екенін растаймын. Денсаулығымның өзгерістері туралы кез келген мәліметті беруге міндеттенемін. ««Freedom Finance Life» Өмірді сақтандыру компаниясы» АҚ менің еңбек қызметіме, дене және психикалық жағдайыма, медициналық анализдердің қорытындыларына қатысты мәліметтерді алатынына, сондай-ақ ««Freedom Finance Life» Өмірді сақтандыру компаниясы» АҚ жіберуі бойынша медициналық мекемесінде медициналық тексерудің өткізуіне келісемін. Сақтандыру туралы өтінішті беру арқылы дәрігерлерді денсаулығыма қатысты дәрігерлік құпияны сақтаудан босатамын.',
        style: 'bold8',
        alignment: 'justify'
      },
      {
        text: 'Сақтандыру шарттарымен таныстым және ««Freedom Finance Life» Өмірді сақтандыру компаниясы» АҚ тәуекелді өтінішті алғаннан кейін ғана сақтандыратынына және сақтандыру қорғауының қолданысы сақтандыру сыйлықақысын төлеген сәттен басталатынына келісемін. Осы өтінішті беру арқылы ««Freedom Finance Life» Өмірді сақтандыру компаниясы» АҚ менің дербес деректерімді Қазақстан Республикасының заңнамасының шегінде және талаптарына сәйкес жинап, сақтап және өндейтініне келісім беремін/',
        style: 'bold8',
        alignment: 'justify'
      },
      {
        text: 'Я подтверждаю достоверность всех сведений, указанных в Заявлении на страхование, которые будут являться неотъемлемой частью Договора, и если какое-либо сведение будет заведомо ложным АО «Компания по страхованию жизни «Freedom Finance Life» имеет право отказать в осуществлении страховой выплаты. Я обязуюсь предоставлять любую информацию об изменениях в состоянии моего здоровья.',
        style: 'bold8',
        alignment: 'justify'
      },
      {
        text: 'Я даю, согласие на получение АО «Компания по страхованию жизни «Freedom Finance Life» информации, касающейся моей трудовой деятельности, физического и психического состояния, результатов медицинских анализов, а также согласен на проведение медицинского обследования в медицинском учреждении по направлению АО «Компания по страхованию жизни «Freedom Finance Life». Данным Заявлением на страхование освобождаю врачей от соблюдения ими врачебной тайны в отношении моего здоровья.',
        style: 'bold8',
        alignment: 'justify'
      },
      {
        text: 'С условиями страхования ознакомлен и согласен с тем, что АО «Компания по страхованию жизни «Freedom Finance Life» принимает риск на страхование после рассмотрения Заявления и действие страховой защиты начинается с момента оплаты страховой премии.',
        style: 'bold8',
        alignment: 'justify'
      },
      {
        text: 'Настоящим заявлением даю согласие АО «Компания по страхованию жизни «Freedom Finance Life» на сбор, хранение и обработку моих персональных данных в рамках и соответствии с требованиями законодательства Республики Казахстан.',
        style: 'bold8',
        alignment: 'justify'
      },
      {
        text: ' ',
        style: 'regular9'
      },
      {
        columns: [
          {
            ul: [
              {
                text: `Күні /Дата: ${props.givenDate} г /ж`,
                fontSize: 8,
                listType: 'none'
              },
              {
                text: ' ',
                style: 'regular9',
                listType: 'none'
              },
              {
                text: `${props.fio}`,
                fontSize: 12,
                bold: true,
                listType: 'none'
              },
              {
                text: ' ',
                style: 'regular9',
                listType: 'none'
              },
              {
                text: `${props.code}`,
                style: 'bold8',
                listType: 'none'
              }
            ]
          },
          {
            ul: [
              {
                text: 'Сақтандырылушы болып табылатын Сақтанушының қолы/',
                style: 'bold8',
                alignment: 'center',
                listType: 'none'
              },
              {
                text: 'Подпись Страхователя, являющегося Застрахованным:',
                style: 'bold8',
                alignment: 'center',
                listType: 'none'
              }
            ]
          }
        ]
      }
    ],
    defaultStyle: {
      font: 'TimesNewRoman'
    },
    styles: {
      bold8: {
        fontSize: 8,
        bold: true
      },
      boldItalics11: {
        fontSize: 11,
        bold: true,
        italics: true
      },
      regular9: {
        fontSize: 9
      },
      italics9: {
        fontSize: 9,
        italics: true
      },
      boldItalics10: {
        fontSize: 10,
        bold: true,
        italics: true
      },
      icon: {
        font: 'emptyCheckbox'
      }
    }
  }

  return (
    <li>
      <a onClick={() => pdfMake.createPdf(insuranceApplication).open()}>
        1. {t('insurance-application')}
      </a>
    </li>
  )
}

export default InsuranceApplicationDocument