import pdfMake from "pdfmake/build/pdfmake";
import pdfFonts from "pdfmake/build/vfs_fonts";

pdfMake.vfs = pdfFonts.pdfMake.vfs;
pdfMake.fonts = {
  TimesNewRoman: {
    normal: 'TimesNewRoman.ttf',
    bold: 'TimesNewRomanBold.ttf',
    italics: 'TimesNewRomanItalics.ttf',
    bolditalics: 'TimesNewRomanBoldItalics.ttf'
  },
  emptyCheckbox: {
    normal: 'emptyCheckbox.ttf'
  }
}

const RestructuringAgreementDocument = (props) => {
  let GESV
  if((+props.period) == 15) {
    GESV = 1875.34
  } else if ((+props.period) == 16) {
    GESV = 1539.32
  } else if ((+props.period) == 17) {
    GESV = 1290.63
  } else if ((+props.period) == 18) {
    GESV = 1101.44
  } else if ((+props.period) == 19) {
    GESV = 954.08
  } else if ((+props.period) == 20) {
    GESV = 836.98
  } else if ((+props.period) == 21) {
    GESV = 742.28
  } else if ((+props.period) == 22) {
    GESV = 664.52
  } else if ((+props.period) == 23) {
    GESV = 599.81
  } else if ((+props.period) == 24) {
    GESV = 545.32
  } else if ((+props.period) == 25) {
    GESV = 498.94
  } else if ((+props.period) == 26) {
    GESV = 459.09
  } else if ((+props.period) == 27) {
    GESV = 424.57
  } else if ((+props.period) == 28) {
    GESV = 394.42
  } else if ((+props.period) == 29) {
    GESV = 367.91
  } else if ((+props.period) == 30) {
    GESV = 344.45
  }

  let RewardLimitPercent
  if(+props.givenDate.split('').slice(0, 2).join('') < 15 && +props.givenDate.split('').slice(3, 5).join('') <= 3 && +props.givenDate.split('').slice(8).join('') <= 22) {
    RewardLimitPercent = '30%'
  } else {
    RewardLimitPercent = '25%'
  }
  let restructuringAgreement = {
    content: [
      {
        text: 'ДОГОВОР РЕСТРУКТУРИЗАЦИИ ДОЛГА / БОРЫШТЫ ҚАЙТА ҚҰРЫЛЫМДАУ ШАРТЫ',
        fontSize: 12,
        bold: true,
        alignment: 'center'
      },
      {
        text: `№${props.contractNumber}`,
        fontSize: 12,
        bold: true,
        alignment: 'center'
      },
      {
        text: ' '
      },
      {
        text: '1.Общие условия договора / Шарттың жалпы талаптары',
        fontSize: 12,
        bold: true,
      },
      {
        text: ' '
      },
      {
        text: '1.1.'
      },
      {
        text: ' '
      },
      {
        table: {
          widths: ['*', '*'],
          body: [
            [
              {
                text: 'Дата заключения договора/ Шарттың жасалған күні',
                fontSize: 12,
                alignment: 'justify'
              },
              {
                text: `${props.givenDate} г/ж`,
                fontSize: 12,
                alignment: 'justify'
              },
            ],
            [
              {
                text: 'Займодатель/Қарыз беруші',
                fontSize: 12,
                alignment: 'justify'
              },
              {
                text: 'ТОО «МФО «I-CREDIT.KZ»», именуемое в дальнейшем «МФО» / ЖШС «МФО «I-CREDIT.KZ»», (бұдан әрі - МҚҰ) ',
                fontSize: 12,
                alignment: 'justify'
              },
            ],
            [
              {
                stack: [
                  {
                    text: 'Заемщик /Қарыз алушы',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '(ФИО /Т.А.Ә.а)',
                    fontSize: 12,
                    alignment: 'justify',
                    italics: true
                  },
                ]
              },
              {
                text: `${props.fio}`,
                fontSize: 12,
              },
            ],
            [
              {
                text: 'Сумма реструктуризированного долга/ Қайта құрылымдалған борыш сомасы',
                fontSize: 12,
                alignment: 'justify'
              },
              {
                text: `${props.main} тенге`,
                fontSize: 12,
                alignment: 'justify'
              },
            ],
            [
              {
                text: 'Срок погашения / Өтеу мерзімі',
                fontSize: 12,
                alignment: 'justify'
              },
              {
                text: `${props.period} календарных дней/күнтізбелік күн`,
                fontSize: 12,
                alignment: 'justify'
              },
            ],
            [
              {
                text: 'Предельное значение вознаграждения/ Сыйақының шекті мәні',
                fontSize: 12,
                alignment: 'justify'
              },
              {
                text: `${RewardLimitPercent}`,
                fontSize: 12,
                alignment: 'justify'
              },
            ],
            [
              {
                text: 'Годовая эффективная ставка вознаграждения/ Сыйақының жылдық тиімді мөлшерлемесі',
                fontSize: 12,
                alignment: 'justify'
              },
              {
                text:`${GESV}%`,
                fontSize: 12,
                alignment: 'justify'
              },
            ],
            [
              {
                text: 'Способ погашения / Өтеу тәсілі',
                fontSize: 12,
                alignment: 'justify'
              },
              {
                stack: [
                  {
                    text: 'Наличными деньгами через кассу/ Қолма - қол ақшамен касса арқылы.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'Безналичным способом - путем перечисления на банковский счет МФО/ Қолма-қол ақшасыз тәсілмен - МҚҰ-ның банк шотына аудару жолымен:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'БИН/БСН 070440003902',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'ИИК/ЖСК KZ976017131000000372',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'АО "Народный Банк Казахстана"АҚ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'БИК/БСК HSBKKZKX',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                ]
              },
            ],
            [
              {
                text: 'Метод погашения / Өтеу әдісі',
                fontSize: 12,
                alignment: 'justify'
              },
              {
                text: 'Единовременный в конце срока договора/ Шарт мерзімінің соңындағы біржолғы',
                fontSize: 12,
                alignment: 'justify'
              },
            ],
            [
              {
                text: 'Размер неустойки и порядок начисления / Тұрақсыздық айыбының мөлшері және есептеу тәртібі',
                fontSize: 12,
                alignment: 'justify'
              },
              {
                text: '0,5 процента от суммы неисполненного обязательства за каждый день просрочки начисляется в первый день неисполнения обязательств по оплате/ Мерзімі өткен әрбір күн үшін орындалмаған міндеттеме сомасының 0,5% төлеу бойынша міндеттемелер орындалмаған бірінші күні есептеле бастайды',
                fontSize: 12,
                alignment: 'justify'
              },
            ],
          ]
        }
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        table: {
          widths: ['*', '*'],
          body: [
            [
              {
                stack: [
                  {
                    text: `1.2. В соответствии с настоящим Договором и Заявлением Заемщика МФО предоставляет реструктуризацию задолженности Заемщика перед МФО по договору №${props.contractNumber} от ${props.givenDate}г. по состоянию на дату подписания данного Договора в размере ${props.main}тенге.`,
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: `1.3. Реструктуризация долга осуществляется путем предоставления отсрочки по уплате долга по договору №${props.contractNumber} от ${props.givenDate}г.`,
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '1.4. Сумма произведенного Заемщиком платежа по Договору, в случае, если она недостаточна для исполнения обязательства Заемщика по Договору, погашает задолженность заемщика в следующей очередности:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '1) издержки МФО по получению исполнения (при наличии), включая, но, не ограничиваясь:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- судебные расходы',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- почтовые/курьерские расходы',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '-расходы по совершению исполнительной надписи;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2) неустойка (штраф, пеня);',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3) задолженность по вознаграждению;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4) задолженность по основному долгу.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '1.5. При неисполнении либо ненадлежащем исполнении Заемщиком обязательств по Договору МФО вправе принять все меры предусмотренные настоящим Договором и законодательством Республики Казахстан, в том числе:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '1) напоминать Заемщику с помощью SMS–уведомлений, писем на электронную почту, телефонных звонков, письменных уведомлений, push-уведомлений о погашении задолженности, а также о необходимости осуществления других мероприятий, связанных с микрокредитом;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2) передать задолженность Заемщика на досудебное взыскание и урегулирование коллекторскому агентству в соответствии с действующим законодательством Республики Казахстан; ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3) по своему усмотрению, без согласия Заемщика уступить права (требования) по настоящему Договору банку второго уровня; коллекторскому агентству; микрофинансовой организации; специальной финансовой компании, созданной в соответствии с законодательством Республики Казахстан о проектном финансировании и секьюритизации, при сделке секьюритизации;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4) передать данные о невозврате микрокредита в кредитные бюро;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5) начислить сумму неустойки и вознаграждения за пользование микрокредитом;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6) взыскать задолженность, включая основной долг, вознаграждение и неустойку (штраф, пеню), на основании исполнительной надписи нотариуса;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '7) обратиться в судебные органы Республики Казахстан за защитой нарушенных прав и взыскания суммы задолженности по Договору.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8) иные методы, не запрещенные законодательством Республики Казахстан.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '1.6. Настоящий договор вступает в силу с момента его подписания Сторонами и действует до полного исполнения Сторонами своих обязательств по Договору.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '1.7. При соблюдении порядка, предусмотренного разделом 6 настоящего договора, Заемщик имеет право в течение пятнадцати календарных дней с даты получения решения МФО, или при недостижении взаимоприемлемого решения об изменении условий договора, обратиться в уполномоченный орган с одновременным уведомлением МФО.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '1.8. Информация о почтовом и электронном адресе МФО, а также данные о ее официальном интернет-ресурсе:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- почтовый адрес: A05H0E3/ 050012, Республика Казахстан, город Алматы, улица Толе би, дом 101, 3 этаж;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- электронный адрес: info@i-credit.kz;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- сайт: www.i-credit.kz.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '1.9. При уступке МФО права (требования) по настоящему договору третьему лицу требования и ограничения, предъявляемые законодательством Республики Казахстан к взаимоотношениям МФО с Заемщиком в рамках договора, распространяются на правоотношения Заемщика с третьим лицом, которому уступлено право (требование).',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2. Льготный период',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: '2.1. МФО в первые 7 календарных дней с даты заключения настоящего Договора предоставляет Заемщику льготный период, в течение которого не начисляет вознаграждение за пользование микрокредитом.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2.2. В случае если, Заемщик не возвратил микрокредит в льготном периоде, МФО начисляет вознаграждение согласно пп.4 п.4.3 договора.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3. Порядок возврата и уплаты вознаграждения микрокредита',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: '3.1. Возврат микрокредита Заемщиком производится в предусмотренный Договором срок.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3.2. Датой оплаты платежа является дата поступления денежных средств на банковский счет МФО либо в кассу.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3.3. Пользуясь услугами третьих лиц, при оплате способом, не предусмотренным частью 1 договора, Заемщик принимает на себя риски задержки платежей при перечислении денежных средств в пользу МФО. При этом, оплата комиссий и других платежей, взимаемых третьими лицами за осуществление переводов, осуществляется Заемщиком самостоятельно.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3.4. Отсчет срока возврата микрокредита и срока начисления вознаграждения (п.2.2.договора) начинается со дня заключения Договора и заканчивается в момент их полного погашения.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4. Права и обязанности Сторон',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4.1. Заемщик вправе:',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: '1) ознакомиться с Правилами предоставления микрокредитов, тарифами по предоставлению микрокредитов на интернет-ресурсе МФО: www.i-credit.kz;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2) распоряжаться микрокредитом в порядке и на условиях, установленных договором;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3) в том случае, если дата платежа выпадает на выходной либо праздничный день, этот платеж производится Заемщиком в следующий за ним рабочий день без уплаты штрафных санкций;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4) досрочно полностью или частично возвратить микрокредит без оплаты неустойки (штрафа, пени);',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5) обратиться к банковскому омбудсману, в случае уступки МФО права (требования) по договору для урегулирования разногласий с лицом, указанным в пунктах 4 и 5 статьи 9-1 Закона Республики Казахстан «О микрофинансовой деятельности»;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6) обратиться в письменной форме в МФО при возникновении спорных ситуаций. При этом любые обращения от Заемщика должны быть оформлены надлежащим образом, созданы на бумажном носителе, заполнены от руки либо при помощи компьютера. Любое обращения или другая информация считаются переданными МФО при их передаче лично или курьером, на дату вручения, с приложением копии документа, удостоверяющего личность Заемщика. Обращение Заемщика, оформленное надлежащим образом, рассматривается МФО в течение 15 дней.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '7) В течение 15 дней с даты получения уведомления МФО об изменении условий Договора в сторону их улучшения для Заемщика, отказаться от предложенных МФО улучшающих условий в порядке, предусмотренном настоящим Договором.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8) защищать свои права в порядке, установленном действующим законодательством Республики Казахстан;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9) осуществлять иные права, установленные законодательством Республики Казахстан.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4.2. Заемщик обязан:',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: '1) возвратить микрокредит и уплатить вознаграждение по нему в сроки и в сумме, предусмотренные договором;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2) представлять документы и сведения, запрашиваемые МФО в соответствии с требованиями законодательства Республики Казахстан и настоящим договором;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3) немедленно уведомлять МФО о наступлении обстоятельств, препятствующих исполнению обязательств по договору;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4) в случае прекращения трудовых отношений между Заемщиком и работодателем Заемщика (по любому основанию) Заемщик обязуется в письменной форме уведомить МФО в течение 1 (одного) рабочего дня такого прекращения;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5) письменно уведомлять МФО о любых изменениях места жительства или адреса регистрации, номера (-ов) мобильного телефона, реквизитов документов, удостоверяющих личность, места работы или ведения бизнеса, изменении банковских реквизитов и других данных, предоставленных МФО, в течение 2 (двух) рабочих дней с даты возникновения таких изменений. В случае неисполнения данной обязанности Заемщиком, МФО вправе считать подлинными и актуальными те данные, которые были указаны в договоре или предоставлены Заемщиком ранее (в анкете), включая все обязательства МФО по уведомлениям/ извещениям, необходимым или связанным с исполнением, изменением или прекращением договора;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6) предоставить МФО всю необходимую информацию в отношении своего финансового положения, а также немедленно извещать МФО обо всех обстоятельствах, способных повлиять на своевременное погашение микрокредита и вознаграждения.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '7) по требованию МФО в случаях, предусмотренных договором, досрочно возвратить микрокредит, уплатить вознаграждение;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8) в случае несвоевременного погашения микрокредита и/или начисленного вознаграждения уплатить МФО неустойку (штрафы, пеню) и просроченное вознаграждение;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9) обеспечить конфиденциальность:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- логина и пароля, используемых Заемщиком для доступа в Личный кабинет. Заемщик не вправе передавать данные логин и пароль третьим лицам, как не вправе предоставлять возможность пользования своей учётной записью на сайте и своим Личным кабинетом третьим лицам;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '-цифрового кода и обеспечивать его безопасность, исключая его передачу третьим лицам.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- SMS-сообщений и не допускать получение доступа к ним третьих лиц.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '10) выполнять иные требования, установленные законодательством Республики Казахстан и настоящим договором.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4.3. МФО вправе:',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: '1) запрашивать у Заемщика документы и сведения, необходимые для заключения договора и исполнения обязательств по нему;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2) по своему усмотрению, без согласия Заемщика, уступить права (требования) по договору в соответствии с действующим законодательством;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3) обратиться за соответствующей информацией ко всем лицам, указанным Заемщиком в контактных данных, в случае неисполнения и/либо ненадлежащего исполнения Заемщиком своих обязательств по договору, на что Заемщик дает свое полное, безотзывное и безусловное согласие;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4) начислить единовременно вознаграждение за каждый день льготного периода, предоставленного Заемщику, в случае если Заемщик не погасил микрокредит в льготном периоде, указанном в ч.2 договора;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5) взимать с Заемщика полную сумму вознаграждения, установленную договором, а в случае досрочного погашения микрокредита, за фактические дни пользования, в соответствии с условиями договора;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6) начислить вознаграждение до предельного значения (указанного в ч.1 договора), в случае если Заемщик своевременно не осуществил возврат микрокредита в порядке и в сроки установленные договором;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '7) потребовать от Заемщика безусловного досрочного возврата микрокредита и уплаты причитающегося вознаграждения за пользование микрокредитом, предусмотренных условиями договора, в случаях:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- неисполнения или ненадлежащего исполнения Заемщиком своих обязательств по договору по возврату микрокредита и/или уплате других платежей, предусмотренных договором, на следующий день после наступления факта нарушения Заемщиком договора; ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- при установлении факта предоставления Заемщиком МФО недостоверных сведений, документов при заключении договора.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'При этом, требование о досрочном возврате микрокредитом, вознаграждения, а также неустойки и просроченного вознаграждения может предъявляться на следующий день со дня, когда МФО стало известно о вышеперечисленных обстоятельствах с указанием срока для исполнения указанных требований.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8) уведомлять Заемщика о необходимости внесения просроченных платежей по Договору и последствиях невыполнения им своих обязательств с момента наступления просроченной задолженности по микрокредиту и/или вознаграждения любым способом, в том числе, но, не ограничиваясь, с использованием одного из следующих средств связи: телефонной, почтовой или электронной (путем передачи SMS-сообщений, в том числе с использованием мессенджеров WhatsApp, Telegram) либо отправки писем на электронную почту, посредством социальных сетей (Facebook, Twitter, ВКонтакте, Одноклассники, Instagram, Мой Мир и другие). Уведомление МФО любым из способов считается надлежаще оформленным, полученным и принятым на обязательное исполнение Заемщиком.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8-1) Датой получения уведомления Заемщиком и его контактными лицами считается:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- для уведомлений посредством SMS – момент отправки SMS;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- для уведомлений, которые вручаются лично или через курьерскую службу – день получения с соответствующей отметкой о доставке;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- для уведомлений, которые отправляются МФО заказным письмом – день вручения данного уведомления;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- для уведомлений, направляемых по электронной почте – день отправки уведомления;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- для уведомлений (голосовых оповещений) по мобильной и иной телефонной связи – дата и время звонка.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9) в одностороннем порядке изменять условия настоящего договора в сторону их улучшения для Заемщика. Заемщик соглашается, что в случае изменений условий Договора в сторону улучшения, МФО уведомит его об этом посредством отправки SMS-сообщения и/или электронного письма на номер телефона или электронный адрес.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '10) требовать от Заемщика исполнения обязанностей, установленных в договоре;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '11) в случае недостижения соглашения по урегулированию задолженности по результатам рассмотрения заявления Заемщика и непредставления Заемщиком возражений по задолженности:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- рассмотреть вопрос о применении мер в отношении заемщика;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- передать задолженность на досудебные взыскание и урегулирование коллекторскому агентству;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- взыскать задолженность, включая основной долг, вознаграждение и неустойку, на основании исполнительной надписи нотариуса без получения согласия Заемщика.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '12) осуществлять иные права, установленные законодательством Республики Казахстан.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4.4. МФО обязана:',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: '1) в случае изменения места нахождения либо изменения наименования письменно известить Заемщика в срок не позднее тридцати календарных дней с даты таких изменений;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2) разместить копию Правил предоставления микрокредитов на своем интернет-ресурсе: www.i-credit.kz;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3) информацию о платежах, связанных с получением, обслуживанием и погашением (возвратом) микрокредита;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4) соблюдать тайну предоставления микрокредита;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5) проинформировать Заемщика о его правах и обязанностях, связанных с возвратом микрокредита, устно, посредством телефонной связи;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6) уведомить Заемщика не позднее 20 дней с даты наступления просрочки о:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- возникновении просрочки по исполнению обязательства по договору и необходимости внесения платежей с указанием размера просроченной задолженности на дату, указанную в уведомлении;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- праве заемщика обратиться в МФО;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '-последствиях невыполнения Заемщиком своих обязательств по договору;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'любым из способов, предусмотренных пп. 8, п.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4.3. договора. При этом, уведомление считается доставленным в соответствии с пп.8-1 п.4.3. договора.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'МФО вправе привлечь коллекторское агентство для уведомления Заемщика.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '7) при заключении договора, содержащего условия перехода права (требования) третьему лицу по Договору уведомить Заемщика любым из способов, предусмотренных п.п. 8 п.4.3. договора:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- до заключения договора уступки права требования о возможности перехода прав (требований) третьему лицу, а также об обработке персональных данных заемщика в связи с такой уступкой;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- о состоявшемся переходе права (требования) третьему лицу в течение 30 календарных дней со дня заключения договора уступки права требования с указанием назначения дальнейших платежей по погашению микрокредита третьему лицу (наименование и место нахождения лица, которому перешло право (требование) по договору полного объема переданных прав (требований), а также остатков просроченных и текущих сумм основного долга, вознаграждения, комиссий, неустойки и других подлежащих уплате сумм. При этом Заемщик дает МФО свое безусловное и безотзывное согласие оповещать о факте переуступке прав и обязательств МФО по настоящему договору третьему лицу всех тех лиц, которых Заемщик указал в контактных данных.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4.5.МФО не вправе:',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: '1) изменять условия договора в одностороннем порядке, за исключением случаев их улучшения для Заемщика.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'Под улучшением условий договора для Заемщика понимаются:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- изменение в сторону уменьшения или полной отмены неустойки;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- изменение в сторону уменьшения ставки вознаграждения по договору.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2) устанавливать и взимать с Заемщика любые платежи, за исключением вознаграждения и неустойки по микрокредиту;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3) требовать от Заемщика, досрочно полностью или частично возвратившего микрокредит, неустойку и другие платежи за досрочный возврат микрокредита;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4) индексировать обязательства и платежи по договору, выданного в тенге, с привязкой к любому валютному эквиваленту;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5) заключать договор с третьими лицами, предметом которого является оказание услуг по досудебным взысканию и урегулированию задолженности, а также сбору информации, связанной с задолженностью заемщика, за исключением случаев заключения такого договора с коллекторским агентством.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6) в период нахождения задолженности на досудебном взыскании и урегулировании у коллекторского агентства:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- обращаться с иском в суд о взыскании задолженности;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- требовать выплаты вознаграждения за период нахождения задолженности в работе у коллекторского агентства, а также начислять в указанный период неустойку за несвоевременное погашение основного долга и вознаграждения;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '7) производить уступку права (требования) по Договору третьему лицу, за исключением уступки права (требования) следующим лицам:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- банку второго уровня;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- коллекторскому агентству;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- микрофинансовой организации;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- специальной финансовой компании, созданной в соответствии с законодательством Республики Казахстан о проектном финансировании и секьюритизации, при сделке секьюритизации;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8) производить уступку права (требования) по договору в отношении одного заемщика нескольким лицам.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9) увеличить сумму микрокредита долга по договору;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '10) взимать неустойку, если дата погашения основного долга и (или) вознаграждения выпадает на выходной либо на праздничный день.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '11) изменять в одностороннем порядке ставки вознаграждения в сторону увеличения.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5. Ответственность',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: '5.1. В случае неисполнения/ненадлежащего исполнения обязательства по возврату микрокредита и (или) уплате вознаграждения по договору Заемщик уплачивает неустойку и проcроченное вознаграждение за каждый день просрочки.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5.2. Уплата неустойки и просроченного вознаграждения, в случае неисполнения или ненадлежащего исполнения обязательств, не освобождают Заемщика от исполнения договора. По требованию об уплате неустойки и просроченного вознаграждения МФО не обязана доказывать причинение ей убытков.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5.3. Уплата штрафов, пени по договору производится Заемщиком по реквизитам, в случае перехода права (требования), указанным в уведомлении Кредитора, а при отсутствии уведомления – по реквизитам МФО, указанным в договоре.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5.4. все платежи Заемщика по договору, включая сумму вознаграждения и неустойки (штрафа, пени), предусмотренных договором, за исключением предмета микрокредита, в совокупности не могут превышать сумму микрокредита за весь период действия договора;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5.5. МФО не несет ответственности за любые:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- сбои при передаче уведомлений и/или за неполадки любого оборудования, при помощи которого должно быть передано и/или получено уведомление, как и со стороны Заемщика так со стороны оператора сотовой сети Заемщика.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- убытки, которые может понести Заемщик в связи с отправкой уведомлений с использованием средств оперативной связи, включая, но, не ограничиваясь, убытки Заемщика, возникшие в результате неполучения/несвоевременного получения уведомлений Заемщиком, злоумышленных действий третьих лиц, если только не будет доказано, что такие убытки явились результатом небрежности или умышленного неисполнения МФО своих обязанностей;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- в том числе косвенные, убытки, ущерб, моральный вред, причиненные Заемщику при реализации МФО своих прав по договору в результате неисполнения /ненадлежащего исполнения Заемщиком обязательств.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5.6. Заемщик принимает на себя весь и любой риск использования каких-либо средств оперативной связи для целей отправки и/или получения уведомлений, включая, но не ограничиваясь, риск любых умышленных действий третьих лиц, в том числе мошенничества, неуполномоченного доступа к отправленной информации, а также утрату такой информации до ее получения Заемщиком/ МФО, вызванную проблемами в работе средств оперативной связи, поставщиков услуг или оборудования, используемого для передачи уведомлений.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5.7. При нарушении обязанности, предусмотренной пп.9 п.4.2. договора, Заемщик самостоятельно несет риск неблагоприятных последствий, вызванных данным нарушением.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5.8. Ответственность МФО определяется в соответствии с законодательством РК.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6. Условия и порядок урегулирования задолженности',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6.1. При наличии просрочки исполнения обязательства по Договору, но не позднее 20 дней с даты ее наступления, МФО уведомляет Заемщика о:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- возникновении просрочки по исполнению обязательства по договору и необходимости внесения платежей с указанием размера просроченной задолженности на дату, указанную в уведомлении;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- праве Заемщика обратиться в МФО;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '-последствиях невыполнения Заемщиком своих обязательств по договору.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'МФО вправе привлечь коллекторское агентство для уведомления Заемщика.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6.2. в течение 30 дней с даты наступления просрочки исполнения обязательства по договору Заемщик имеет право посетить МФО и (или) представить в письменной форме заявление, содержащее сведения о причинах возникновения просрочки исполнения обязательства по договору, доходах и других подтвержденных обстоятельствах (фактах).',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6.3. МФО в течение пятнадцати календарных дней после дня получения заявления Заемщика, соответствующего условиям, предусмотренным пп.6, п.4.1. договора, рассматривает предложенные изменения в условия договора и сообщает Заемщику в письменной форме либо способом, предусмотренным договором о (об):',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- согласии с предложенными изменениями в условия договора;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- своих предложениях по урегулированию задолженности;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- отказе в изменении условий договора с указанием мотивированного обоснования причин отказа.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6.4. Заемщик имеет право в течение пятнадцати календарных дней с даты получения решения МФО или при недостижении взаимоприемлемого решения об изменении условий договора, обратиться в уполномоченный орган с одновременным уведомлением МФО.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6.5. МФО в случае недостижения соглашения по урегулированию задолженности по результатам рассмотрения заявления Заемщика и непредставления Заемщиком возражений по задолженности:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- рассмотреть вопрос о применении мер в отношении заемщика;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- передать задолженность на досудебные взыскание и урегулирование коллекторскому агентству;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- взыскать задолженность, включая основной долг, вознаграждение, неустойку, просроченное вознаграждение на основании исполнительной надписи нотариуса без получения согласия Заемщика.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '7. Исполнительная надпись',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '7.1. Заемщик уведомлён и признает право МФО на обращение к нотариусу за совершением исполнительной надписи в случае неисполнения Заемщиком обязательств, предусмотренных настоящим Договором, срок исполнения по которым наступил, с правом взыскания МФО в бесспорном порядке сумм: основного долга, вознаграждения, неустойки, просроченного вознаграждения, почтовые/ курьерские расходы.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'Заемщик подтверждает и признает, что положения настоящего пункта Договора являются согласием Заемщика о признании его бесспорной ответственности как должника перед МФО/взыскателем по настоящему Договору (что также приравнивается к ответу на претензию в порядке досудебного урегулирования спора и письменным признанием должником вины в неисполненном обязательстве).',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '7.2. Заемщик дает согласие на совершение исполнительной надписи по выбору МФО/Взыскателя и на основании заявления МФО/ Взыскателя, нотариусом:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- по месту регистрации Заемщика;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- по месту адреса Заемщика, указанного в договоре и в анкете;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- по адресу местонахождения любого нотариуса Республики Казахстан, независимо от места жительства, места нахождения или места регистрации взыскателя/МФО и/или Заемщика.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8. Заемщик дает безусловное и безотзывное согласие:',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8.1. на списание денежных средств со счета банковской карты посредством Автоматического платежа (платежей) в пользу МФО (применение рекуррентных платежей);',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8.2. осуществлять с персональными данными любое действие (операцию) или совокупности таких действий (операций), в том числе, совершаемых с использованием средств автоматизации или без использования последних, включая, но не ограничиваясь, сбор, обработка, запись, копирование, резервное копирование, защита, скрининг, систематизация, накопление, хранение внутри МФО и за его пределами, уточнение (изменение, обновление), извлечение, использование, передачу (распространение, предоставление доступа, в том числе, передачу третьим лицам с правом обработки персональных данных субъекта, включая трансграничную передачу), обезличивание, блокирование, удаление, уничтожение, в том числе осуществление этих действий третьим лицом по поручению МФО;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8.3. на получение МФО информации о нем из любых возможных источников, включая государственные базы данных;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8.4. на раскрытие и предоставление МФО, в случае неисполнения / ненадлежащего исполнения Заемщиком обязательств по договору, любой информации любым третьим лицам, необходимой для реализации МФО своих прав по договору, включая информацию о размере задолженности Заемщика перед МФО, о характере предъявленных и предъявляемых в будущем требований и претензий, вызванных нарушениями условий договора, а также оповещение любых третьих лиц об этом посредством телефонных звонков, уведомления в виде телефонограммы, автоматизированной телефонии, SMS, через любые мессенджеры или письменным уведомлением, включая уведомления по месту работы Заемщика и иными способами.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8.5. на ведение МФО аудиозаписи разговоров с Заемщиком в целях контроля исполнения Заемщиком условий настоящего Договора;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8.6. на уступку прав требований по договору третьим лицам;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8.7. на получение от МФО рекламных материалов и информации об услугах и акциях МФО.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9. Порядок внесения изменений в условия Договора и иные условия',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9.1. Изменение условий договора может иметь место в случае заключения между Сторонами соответствующего соглашения к договору.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9.2. При изменении условий договора в сторону их улучшения для Заемщика дополнительное соглашение не заключается.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9.3. Договор составлен на государственном и русском языках. В случае разночтений между государственным и русским вариантами договора, приоритет имеет вариант Договора, составленный на русском языке.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9.4. Признание недействительной части настоящего Договора не влечет недействительности прочих его частей и Договора в целом.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9.5. Вся переписка по поводу настоящего договора ведется на русском языке.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9.6. Во всем остальном, что не предусмотрено настоящим договором, Стороны руководствуются Правилами предоставления микрокредитов, размещенных на интернет-ресурсе: www.i-credit.kz.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9.7. Подписанием настоящего договора Заемщик подтверждает, что ознакомлен и согласен с Правилами предоставления микрокредитов, размещенными на официальном сайте МФО: www.i-credit.kz.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '10. Арбитражная оговорка',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '10.1. Любой спор, разногласие, противоречие или требование, договорного или внедоговорного характера, вытекающие из настоящего Договора или в связи с ним, в том числе касающиеся его существования, действительности, толкования, исполнения, нарушения или прекращения передаются на рассмотрение в Международный Арбитражный суд «АВАЛЬ» и окончательно разрешаются в рамках арбитражного разбирательства, проводимого Международным Арбитражным судом «АВАЛЬ» по месту его нахождения, в составе одного арбитра в соответствии с его Регламентом.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '10.2. Решение Международного Арбитражного суда «АВАЛЬ» является окончательными и обязательным для Сторон.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '10.3. Стороны подтверждают, что указанное в настоящем разделе является арбитражным соглашением, заключенным в письменной форме.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'РЕКВИЗИТЫ СТОРОН:',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: 'Займодатель:',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true,
                    italics: true
                  },
                  {
                    text: 'ТОО «МФО «I-CREDIT.KZ»',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'БИН 070440003902',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'ИИК KZ976017131000000372',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'АО "Народный Банк Казахстана"',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'БИК HSBKKZKX',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'МП',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'Заемщик:',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true,
                    italics: true
                  },
                  {
                    text: `${props.fio}`,
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: `ИИН ${props.iin}`,
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: `удостоверение личности ${props.cardNumber},`,
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: `выдано ${props.cardGiven} от ${props.startCard}`,
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: `адрес: ${props.address}`,
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: `тел. +${props.phone}`,
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: `e-mail: ${props.email}`,
                    fontSize: 12,
                    alignment: 'justify'
                  },
                ]
              },
              {
                stack: [
                  {
                    text: `1.2. МҚҰ осы Шартқа және Қарыз алушының өтінішіне сәйкес ${props.givenDate}ж №${props.contractNumber} электрондық тәсілмен микрокредит беру туралы шарт бойынша Қарыз алушының МҚҰ алдындағы осы Шартқа қол қойылған күнгі ${props.main} теңге мөлшерінде берешегін қайта құрылымдауды ұсынады.`,
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: `1.3. Борышты қайта құрылымдау ${props.givenDate}ж №${props.contractNumber} электрондық тәсілмен микрокредит беру туралы шарт бойынша борышты төлеу мерзімін кейінге қалдыруды беру арқылы жүзеге асырылады.`,
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '1.4. Шарт бойынша Қарыз алушы жүргізген төлемнің сомасы, егер ол Шарт бойынша Қарыз алушының міндеттемесін орындау үшін жеткіліксіз болған жағдайда, Қарыз алушының берешегін мынадай кезектілікпен өтейді:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '1)МҚҰ-ның орындауды алу бойынша шығындары (бар болса), қоса алғанда, бірақ олармен шектелмей:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- сот шығындары;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- пошталық / курьерлік шығындар;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '-атқарушылық жазба жасау бойынша шығыстар;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2) тұрақсыздық айыбы (айыппұл, өсімпұл);',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3) сыйақы бойынша берешек;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4) негізгі борыш бойынша берешек.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '1.5. Қарыз алушы Шарт бойынша міндеттемелерін орындамаған не тиісінше орындамаған кезде МҚҰ осы Шартта және Қазақстан Республикасының заңнамасында көзделген барлық шараларды, оның ішінде:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '1) Қарыз алушыға SMS–хабарламалардың, электрондық поштаға хаттардың көмегімен ескерту, телефон қоңыраулары, жазбаша хабарламалар, өтеу туралы push-хабарламалар сондай-ақ микрокредитқа байланысты басқа да іс-шараларды жүзеге асыру қажеттілігі туралы хабардар ету;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2) қолданыстағы Қазақстан Республикасының заңнамасына сәйкес Қарыз алушының берешегін коллекторлық агенттікке сотқа дейінгі өндіріп алуға және реттеуге беру;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3) Қарыз алушының келісімінсіз, өз қалауы бойынша екінші деңгейдегі банкке; коллекторлық агенттікке; микроқаржылық ұйымына; секьюритилендіру мәмілесі кезінде Қазақстан Республикасының жобалық қаржыландыру және секьюритилендіру туралы заңнамасына сәйкес құрылған арнайы қаржы компаниясына беру;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4) микрокредитті қайтармау туралы деректерді кредиттік бюроларға беру;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5) микрокредитті пайдаланғаны үшін тұрақсыздық айыбы мен сыйақы сомасын есептеу;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6) негізгі борышты, сыйақыны және тұрақсыздық айыбын (айыппұлды, өсімпұлды) қоса алғанда, берешекті Нотариустың атқарушылық жазбасы негізінде өндіріп алу;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '7) бұзылған құқықтары мен бостандықтарын қорғау және шарт бойынша берешек сомасын өндіріп алу үшін Қазақстан Республикасының сот органдарына жүгіну;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8) Қазақстан Республикасының заңнамасында тыйым салынбаған өзге де әдістер.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '1.6. Осы Шарт Тараптар қол қойған сәттен бастап күшіне енеді және Тараптар ол бойынша өз міндеттемелерін орындаған сәтке дейін қолданылады.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '1.7. Осы Шарттың 6-бөлімінде көзделген тәртіп сақталған кезде Қарыз алушы МҚҰ шешімін алған күннен бастап күнтізбелік он бес күн ішінде немесе шарттың талаптарын өзгерту туралы өзара қолайлы шешімге қол жеткізілмеген кезде МҚҰ-ны бір мезгілде хабардар ете отырып, уәкілетті органға жүгінуге құқылы.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '1.8. МҚҰ-ның пошталық мекенжайы және электрондық мекенжайы туралы ақпарат, сондай-ақ оның ресми интернет-ресурсы туралы деректер:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'Пошталық мекенжайы: A05H0E3/ 050012, Қазақстан Республикасы, Алматы қаласы, Төле би көшесі, 101, 3 қабат',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'Электрондық мекен-жайы: info@i-credit.kz',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'Ресми интернет-ресурсы: www.i-credit.kz',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '1.9. МҚҰ осы Шарт бойынша құқықты (талап етуді) үшінші тұлғаға берген кезде шарт шеңберінде МҚҰ-ның Қарыз алушымен өзара қарым-қатынастарына Қазақстан Республикасының заңнамасымен қойылатын талаптар мен шектеулер қарыз алушының құқық (талап ету) берілген үшінші тұлғамен құқықтық қатынастарына қолданылады.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2. Жеңілдікті кезең',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2.1. МҚҰ осы Шарт жасасқаннан күннен бастап алғашқы 7 күнтізбелік күнде Қарыз алушыға жеңілдікті кезең береді, осы мерзім ішінде микрокредитті пайдаланғаны үшін сыйақы есептемейді.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2.2.Егер Қарыз алушы микрокредитті жеңілдікті кезеңде қайтармаса, МҚҰ сыйақыны Шарттың 4.3.т. 4 т. сәйкес есептейді.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3. Микрокредитті және сыйақы қайтару тәртібі',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: '3.1. Қарыз алушы микрокредитті қайтаруды Шартта көзделген мерзімде жүргізеді.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3.2. Ақша қаражатының МҚҰ-ның банк шотына не кассаға келіп түскен күні төлемді төлеу күні болып табылады.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3.3. Шарттың 1-бөлігінде көзделмеген тәсілмен ақы төлеу кезінде үшінші тұлғалардың қызметтерін пайдалана отырып, Қарыз алушы ақша қаражатын МҚҰ пайдасына аудару кезінде төлемдердің кешіктірілу тәуекелдерін өзіне қабылдайды. Бұл ретте аударымдарды жүзеге асырғаны үшін үшінші тұлғалар алатын комиссиялар мен басқа да төлемдерді қарыз алушы дербес жүзеге асырады.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3.4. Микрокредитті қайтару мерзімін және сыйақыны есептеу мерзімін есептеу (шарттың 2.2 т.) Шарт жасасқаннан күннен басталады және оларды толық өтеген кезде аяқталады.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4. Тараптардың құқықтары мен міндеттері',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4.1. Қарыз алушы:',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: '1) www.i-credit.kz МҚҰ интернет-ресурсында микрокредиттер беру қағидаларымен, микрокредиттер беру тарифтерімен танысуға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2) микрокредитпен шартта белгіленген тәртіппен және талаптарда билік етуге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3) егер төлем күні демалыс не мереке күніне түскен жағдайда, бұл төлемді Қарыз алушы одан кейінгі жұмыс күні айыппұл санкцияларын төлемей жүргізбеуге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4) микрокредитті тұрақсыздық айыбын (айыппұлды, өсімпұлды) төлемей мерзімінен бұрын толық немесе ішінара қайтаруға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5) микроқаржы қызметі туралы Қазақстан Республикасы Заңының 9-1-бабының 4 және 5 тармақтарында көрсетілген тұлғамен келіспеушіліктерді реттеу үшін шарт бойынша МҚҰ құқығын (талап етуін) басқаға берген жағдайда банк омбудсманына жүгінуге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6) даулы жағдайлар туындаған кезде МҚҰ-ға жазбаша түрде жүгінуге құқылы.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'Бұл ретте Қарыз алушының кез келген өтініштері тиісті түрде ресімделуі, қағаз тасығышта жасалуы, қолмен немесе компьютердің көмегімен толтырылуы тиіс.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'Кез келген өтініштер немесе басқа ақпарат МҚҰ-ға оларды Қарыз алушының жеке басын куәландыратын құжаттың көшірмесін қоса бере отырып, тапсыру күніне жеке өзі немесе курьермен берген кезде берілген болып есептеледі.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'Қарыз алушының тиісті түрде ресімделген өтінішін МҚҰ 15 күн ішінде қарайды.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '7) Қарыз алушы үшін Шарт талаптарын жақсарту жағына қарай өзгерту туралы МҚҰ хабарламасын алған күннен бастап 15 күн ішінде МҚҰ ұсынған жақсарту талаптарынан осы Шартта көзделген тәртіппен бас тартуға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8) Қазақстан Республикасының қолданыстағы заңнамамен белгіленген тәртіпте өз құқықтарын қорғауға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9) Қазақстан Республикасының заңнамасында белгіленген өзге де құқықтарды жүзеге асыруға.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4.2. Қарыз алушы:',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: '1) микрокредитті шартта көзделген мерзімде қайтаруға және ол бойынша сыйақы төлеуге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2) Қазақстан Республикасы заңнамасының талаптарына және осы Шартқа сәйкес МҚҰ сұратқан құжаттар мен мәліметтерді ұсынуға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3) шарт бойынша міндеттемелерді орындауға кедергі келтіретін жағдайлардың туындағаны туралы МҚҰ-ға дереу хабарлауға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4) Қарыз алушы мен жұмыс берушінің арасындағы еңбек қатынастары тоқтатылған жағдайда Қарыз алушы (кез келген негіз бойынша) осындай тоқтатудың 1 (бір) жұмыс күні ішінде МҚҰ-ға жазбаша нысанда хабарлауға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5) МҚҰ ұсынған тұрғылықты жерінің немесе тіркеу мекен жайының, ұялы телефон нөмірінің (нөмірлерінің), жеке басты куәландыратын құжаттардың деректемелерінің, жұмыс орнының немесе бизнесті жүргізудің кез келген өзгерістері, банк деректемелерінің және басқа да деректердің өзгергені туралы МҚҰ-ға осындай өзгерістер туындаған күннен бастап 2 (екі) жұмыс күні ішінде жазбаша хабарлауға міндетті. Қарыз алушы осы міндетті орындамаған жағдайда МҚҰ Шартта және көрсетілген немесе Қарыз алушы бұрын берген деректерді сауалнамада, соның ішінде МҚҰ-ның шартты орындауға, өзгертуге немесе тоқтатуға қажетті немесе байланысты хабарламалар бойынша барлық міндеттемелерін түпнұсқа және өзекті деп санауға құқылы.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6) МҚҰ-ға өзінің қаржылық жағдайына қатысты барлық қажетті ақпаратты беруге, сондай-ақ МҚҰ-ға микрокредитті және ол бойынша сыйақыны уақтылы өтеуге ықпал ете алатын барлық мән-жайлар туралы дереу хабарлауға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '7) шартта көзделген жағдайларда МҚҰ-ның талап етуі бойынша қайта құрылымдалған борыш сомасын мерзімінен бұрын қайтаруға, сыйақы төлеуге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8) микрокредитті және/немесе есептелген сыйақы уақтылы өтелмеген жағдайда МҚҰ-ға шартта көзделген тұрақсыздық айыбын (айыппұлдарды, өсімпұлдарды) және мерзімі өткен сыйақыны төлеуге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9) құпиялылықты қамтамасыз ету:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- жеке кабинетке кіру үшін Қарыз алушы пайдаланатын логин мен пароль. Қарыз алушы осы логин мен парольді үшінші тұлғаларға беруге құқылы емес, өйткені сайттағы өзінің есептік жазбасын және өзінің жеке кабинетін үшінші тұлғаларға пайдалануға мүмкіндік беруге құқылы емес;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- сандық кодты үшінші тұлғаларға беруді қоспағанда, оның қауіпсіздігін қамтамасыз ету;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- SMS-хабарламалар және оларға үшінші тұлғалардың қол жеткізуіне жол бермеу;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '10) Қазақстан Республикасының заңнамасында және осы шартта белгіленген өзге де талаптарды орындауға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4.3. МҚҰ міндеттенеді:',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: '1) Қарыз алушыдан шарт жасасуға және ол бойынша міндеттемелерді орындауға қажетті құжаттар мен мәліметтерді сұратуға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2) өз қалауы бойынша, Қарыз алушының келісімінсіз, қолданыстағы заңнамаға сәйкес шарт бойынша құқықтарды (талаптарды) беруге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3) Қарыз алушы Шарт бойынша өз міндеттемелерін орындамаған және/немесе тиісінше орындамаған жағдайда, Қарыз алушы өзінің толық, қайтарып алынбайтын және сөзсіз келісімін беретін байланыс деректерінде көрсетілген барлық тұлғаларға тиісті ақпарат алу үшін жүгінуге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4) егер Қарыз алушы шарттың 2-бөлігінде көрсетілген жеңілдікті кезеңде микрокредитті өтемеген жағдайда, Қарыз алушыға берілген жеңілдікті кезеңнің әрбір күні үшін біржолғы сыйақыны есептеуге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5) Қарыз алушыдан шартта белгіленген сыйақының толық сомасын, ал микрокредитті мерзімінен бұрын өтелген жағдайда, Шарттың талаптарына сәйкес нақты пайдаланған күндері үшін өндіріп алуға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6) егер Қарыз алушы микрокредитті қайтаруды Шартта белгіленген тәртіппен және мерзімде уақтылы жүзеге асырмаған жағдайда, (Шарттың 2-бөлігінде көрсетілген) сыйақыны шекті мәнге дейін есептеуге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '7) Қарыз алушыдан микрокредитті мерзімінен бұрын сөзсіз қайтаруды және Шарттың талаптарында көзделген микрокредитті пайдаланғаны үшін тиесілі сыйақыны төлеуді мынадай жағдайларда:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- Қарыз алушының микрокредитті қайтару және/немесе Шартта көзделген басқа да төлемдерді төлеу жөніндегі Шшарт бойынша өз міндеттемелерін орындамауы немесе тиісінше орындамауы Қарыз алушының шартты бұзу фактісі басталғаннан кейінгі келесі күні;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- Қарыз алушының МҚҰ-ға шарт жасасу кезінде дәйексіз мәліметтерді, құжаттарды ұсыну фактісі анықталған кезде.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'Бұл ретте микрокредитті, сыйақыны, сондай-ақ тұрақсыздық айыбын, мерзімі өткен сыйақыны  мерзімінен бұрын қайтару туралы талап МҚҰ жоғарыда аталған мән-жайлар туралы белгілі болған күннен бастап келесі күні, көрсетілген талаптарды орындау үшін мерзім көрсетіле отырып қойылуы мүмкін.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8) Қарыз алушыны Шарт бойынша мерзімі өткен төлемдерді енгізу қажеттілігі және микрокредит және/немесе сыйақы бойынша мерзімі өткен берешек туындаған сәттен бастап өз міндеттемелерін орындамау салдары туралы кез келген тәсілмен, оның ішінде, бірақ шектелмей, мына байланыс құралдарының бірін: телефонды, пошталық немесе электрондық (SMS-хабарламаларды жіберу, оның ішінде WhatsApp, Telegram мессенджерлерін пайдалану арқылы немесе Facebook, Twitter, ВКонтакте, Одноклассники, Instagram, Мой Мир және т.б. әлеуметтік желілер арқылы хаттар жіберу) пайдалана отырып хабардар етуге.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'МҚҰ-ны кез келген тәсілмен хабардар ету тиісінше ресімделген, Қарыз алушы алған және міндетті орындауға қабылдаған болып есептеледі.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8-1) Қарыз алушы мен оның байланыс тұлғалары хабарламаны алған күн болып саналады:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- SMS арқылы хабарламалар үшін-SMS жолдау сәті;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- жеке немесе курьерлік қызмет арқылы берілетін хабарламалар үшін – жеткізілгені туралы тиісті белгісі бар алынған күн;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- МҚҰ тапсырыс хатпен жөнелтілетін хабарламалар үшін-осы хабарлама тапсырылған күн;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- электрондық пошта арқылы жіберілетін хабарламалар үшін-хабарлама жіберілген күн;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- ұялы және басқа телефон байланысы бойынша хабарламалар (дауыстық хабарламалар) үшін-қоңырау күні мен уақыты.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9) осы шарттың талаптарын Қарыз алушы үшін оларды жақсарту жағына қарай біржақты тәртіппен өзгерту. Қарыз алушы шарттың талаптары жақсару жағына қарай өзгерген жағдайда, МҚҰ оны бұл туралы телефон нөміріне немесе электрондық мекенжайға SMS-хабарлама және/немесе электрондық хат жіберу арқылы хабардар етуге келіседі.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '10) Қарыз алушыдан шартта белгіленген міндеттерді орындауды талап ету;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '11) Қарыз алушының өтінішін қарау нәтижелері бойынша берешекті реттеу жөнінде келісімге қол жеткізілмеген және Қарыз алушы берешек бойынша қарсылықтарды ұсынбаған жағдайда:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- Қарыз алушыға қатысты шаралар қолдану туралы мәселені қарауға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- берешекті сотқа дейін өндіріп алуға және реттеуге коллекторлық агенттікке беруге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- Қарыз алушының келісімін алмай, нотариустың атқарушылық жазбасы негізінде негізгі борышты, сыйақыны және тұрақсыздық айыбын қоса алғанда, берешекті өндіріп алуға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '12) Қазақстан Республикасының заңнамасында белгіленген өзге де құқықтарды жүзеге асыруға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4.4. МҚҰ құқылы:',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: '1) атауы өзгерген жағдайда осындай өзгерістер болған күннен бастап күнтізбелік отыз күннен кешіктірілмейтін мерзімде Қарыз алушыны жазбаша хабардар етуге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2) микрокредиттер беру қағидаларының көшірмесін өзінің www.i-credit.kz интернет-ресурсында орналастыруға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3) Қарыз алушыға микрокредит бойынша қызмет көрсетуге және оны өтеуге (қайтаруға) байланысты төлемдер туралы толық және анық ақпарат беруге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4) микрокредит беру құпиясын сақтауға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5) Қарыз алушыны микрокредитқа байланысты оның құқықтары мен міндеттері туралы ауызша, телефон байланысы арқылы хабардар етуге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6) Қарыз алушыны мерзімі өткен күннен бастап 20 күннен кешіктірмей:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- шарт бойынша міндеттемелерді орындау бойынша мерзімін өткізіп алудың туындауы және хабарламада көрсетілген күні мерзімі өткен берешектің мөлшерін көрсете отырып, төлемдер енгізу қажеттілігі;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- Қарыз алушының МҚҰ-ға жүгіну құқығы;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- Қарыз алушының шарт бойынша өз міндеттемелерін орындамауының салдарын;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'шарттың 4.3.т. 8 тармақшасында көзделген тәсілдердің кез келгенімен хабардар етуге.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'Бұл ретте, хабарлама шарттың 4.3.т. 8-1. тармақшасы сәйкес жеткізілген болып есептеледі.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'МҚҰ Қарыз алушыны хабардар ету үшін коллекторлық агенттікті тартуға құқылы.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '7) Шарт бойынша құқықтың (талап етудің) үшінші тұлғаға өту талаптары қамтылған шартты жасасу кезінде Қарыз алушыны:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- талап ету құқығын басқаға беру шарты жасалғанға дейін құқықтардың (талаптардың) үшінші тұлғаға өту мүмкіндігі туралы, сондай-ақ осындай басқаға беруге байланысты Қарыз алушының дербес деректерін өңдеу туралы;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- талап ету құқығын басқаға беру шарты жасалған күннен бастап күнтізбелік 30 күн ішінде үшінші тұлғаға құқықтың (талап етудің) өтіп кеткені туралы үшінші тұлғаға микрокредитті өтеу бойынша одан арғы төлемдердің тағайындалуын (шарт бойынша құқық (талап ету) өткен тұлғаның атауы және орналасқан жері), берілген құқықтардың (талаптардың) толық көлемін, сондай-ақ негізгі борыштың, сыйақының, комиссиялардың, тұрақсыздық айыбының және төленуге жататын басқа да сомалардың мерзімі өткен және ағымдағы сомаларының қалдықтарын көрсете отырып, шарттың 4.3.т., 8 тармақшасында көзделген тәсілдердің кез келгенімен хабардар етуге міндетті.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'Бұл ретте Қарыз алушы МҚҰ-ға осы Шарт бойынша МҚҰ құқықтары мен міндеттемелерінің Қарыз алушы байланыс деректерінде көрсеткен барлық тұлғалардың үшінші тұлғаға беру фактісі туралы хабарлауға өзінің сөзсіз және қайтарып алынбайтын келісімін береді.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4.5.МҚҰ құқығы жоқ:',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: '1) Қарыз алушы үшін жақсарту жағдайларын қоспағанда, шарттың талаптарын біржақты тәртіппен өзгертуге құқылы емес.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'Қарыз алушы үшін Шарт талаптарын жақсарту деп:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- тұрақсыздық айыбын азайту немесе толық жою жағына қарай өзгерту;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- шарт бойынша сыйақы мөлшерлемесін азайту жағына өзгерту.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '2) Қарыз алушыдан микрокредит бойынша сыйақы мен тұрақсыздық айыбын қоспағанда, кез келген төлемдерді белгілеуге және алуға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '3) микрокредитті мерзімінен бұрын толық немесе ішінара қайтарған Қарыз алушыдан микрокредитті мерзімінен бұрын қайтарғаны үшін тұрақсыздық айыбын және басқа да төлемдерді талап етуге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '4) кез келген валюталық баламасына байланыстыра отырып, теңгемен берілген шарт бойынша міндеттемелер мен төлемдерді индекстеуге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5) коллекторлық агенттікпен осындай шарт жасасу жағдайларын қоспағанда, нысанасы берешекті сотқа дейін өндіріп алу және реттеу, сондай-ақ Қарыз алушының берешегіне байланысты ақпарат жинау жөнінде қызметтер көрсету болып табылатын үшінші тұлғалармен Шарт жасасуға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6) берешек коллекторлық агенттікте сотқа дейін өндіріп алуда және реттеуде болған кезеңде:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- берешекті өндіріп алу туралы сотқа талап қоюмен жүгінуге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- берешек коллекторлық агенттікте жұмыста болған кезең үшін сыйақы төлеуді талап етуге, сондай-ақ негізгі борышты және сыйақыны уақтылы өтемегені үшін көрсетілген кезеңге тұрақсыздық айыбын есепке жазуға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '7) Шарт бойынша құқықты (талап етуді) мынадай тұлғаларға қоспағанда:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- екінші деңгейдегі банкке;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- коллекторлық агенттікке;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- микроқаржы ұйымдары;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- секьюритилендіру мәмілесі кезінде Қазақстан Республикасының жобалық қаржыландыру және секьюритилендіру туралы заңнамасына сәйкес құрылған арнайы қаржы компаниясы, үшінші тұлғаға беруге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9) Шарт бойынша микрокредит сомасын ұлғайтуға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '10) егер негізгі борышты және (немесе) сыйақыны өтеу күні демалыс не мереке күніне түссе, тұрақсыздық айыбын өндіріп алуға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '11) сыйақы мөлшерлемесін бір жақты тәртіппен ұлғайту жағына өзгертуге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5. Жауапкершілік',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: '5.1. Шарт бойынша микрокредитті қайтару және (немесе) сыйақы төлеу жөніндегі міндеттеме орындалмаған / тиісінше орындалмаған жағдайда Қарыз алушы мерзімі өткен әрбір күн үшін тұрақсыздық айыбын және мерзімі өткен сыйақыны төлейді.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5.2. Міндеттемелерді орындамаған немесе тиісінше орындамаған жағдайда тұрақсыздық айыбын және мерзімі өткен сыйақыны төлеу Қарыз алушыны шартты орындаудан босатпайды. Тұрақсыздық айыбын және мерзімі өткен сыйақыны төлеу туралы талап бойынша МҚҰ оған келтірілген залалдарды дәлелдеуге міндетті емес.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5.3. Шарт бойынша айыппұлдарды, өсімпұлдарды төлеуді Қарыз алушы құқық (талап ету) ауысқан жағдайда кредитордың хабарламасында көрсетілген деректемелер бойынша, ал хабарлама болмаған кезде – шартта көрсетілген МҚҰ деректемелері бойынша жүргізеді.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5.4. микрокредит нысанасын қоспағанда, Шартта көзделген сыйақы мен тұрақсыздық айыбының (айыппұлдың, өсімпұлдың) сомасын қоса алғанда, микрокредит беру туралы шарт бойынша Қарыз алушының барлық төлемдері жиынтығында шарт қолданылатын бүкіл кезең үшін микрокредит сомасынан аспауға тиіс;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5.5. МҚҰ кез келген:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- хабарламаларды беру кезіндегі және/немесе оның көмегімен Қарыз алушы тарапынан да, Қарыз алушының ұялы желі операторы тарапынан да хабарлама берілуі және/немесе алынуы тиіс кез келген жабдықтың ақаулары, іркілістер;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- егер мұндай залалдардың МҚҰ-ның ұқыпсыздығының немесе өз міндеттерін қасақана орындамауының нәтижесі болғаны дәлелденбесе, Қарыз алушының хабарламаларды, үшінші тұлғалардың қаскүнемдік әрекеттерін алмаған/уақтылы алмаған нәтижесінде туындаған залалдарды қоса алғанда, бірақ шектелмей, жедел байланыс құралдарын пайдалана отырып, хабарламаларды жіберуге байланысты Қарыз алушы келтіруі мүмкін залалдар;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- Қарыз алушының міндеттемелерін орындамауы/тиісінше орындамауы нәтижесінде шарт бойынша МҚҰ өз құқықтарын іске асыру кезінде Қарыз алушыға келтірілген кез келген, оның ішінде жанама залалдар, залалдар, моральдық зиян үшін; жауапты емес.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5.6. Қарыз алушы үшінші тұлғалардың кез келген қасақана іс-әрекеттерінің, оның ішінде алаяқтықтың, жіберілген ақпаратқа рұқсатсыз қол жеткізудің, сондай-ақ мұндай ақпаратты Қарыз алушы МҚҰ алғанға дейін жедел байланыс құралдарының, хабарламаларды беру үшін пайдаланылатын қызметтерді жеткізушілердің немесе жабдықтардың жұмысындағы проблемалардан туындаған жоғалудың тәуекелін қоса алғанда, бірақ олармен шектелмей, хабарламаларды жіберу және/ немесе алу мақсаттары үшін қандай да бір жедел байланыс құралдарын пайдаланудың барлық және кез келген тәуекелін өзіне қабылдайды.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5.7. шарттың 4.2. т. 9 т. көзделген міндетті бұзған жағдайда Қарыз алушының осы бұзушылықтан туындаған қолайсыз салдарлар тәуекелін дербес көтереді.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '5.8. МҚҰ жауапкершілігі ҚР заңнамасына сәйкес анықталады.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6. Берешекті реттеу шарттары мен тәртібі',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: '6.1. Шарт бойынша міндеттемені орындау мерзімін өткізіп алған жағдайда, бірақ ол басталған күннен бастап 20 күннен кешіктірмей МҚҰ Қарыз алушыны:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- шарт бойынша міндеттемелерді орындау бойынша мерзімін өткізіп алудың туындауы және хабарламада көрсетілген күні мерзімі өткен берешектің мөлшерін көрсете отырып, төлемдер енгізу қажеттілігі туралы;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- Қарыз алушының МҚҰ-ға жүгіну құқығы;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '-Қарыз алушының Шарт бойынша өз міндеттемелерін орындамауының салдары; жайлы хабардар етеді.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'МҚҰ Қарыз алушыны хабардар ету үшін коллекторлық агенттікті тартуға құқылы.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6.2. шарт бойынша міндеттемелерді орындау мерзімін өткізіп алған күннен бастап 30 күн ішінде Қарыз алушы МҚҰ-ға баруға және (немесе) шарт бойынша міндеттемелерді орындау мерзімін өткізіп алудың туындау себептері, кірістері және басқа да расталған мән-жайлары (фактілері) туралы мәліметтерді қамтитын өтінішті жазбаша нысанда ұсынуға құқылы.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6.3. МҚҰ Қарыз алушының шарттың 6-т., 4.1-т. көзделген шарттарға сәйкес келетін өтінішін алған күннен кейін күнтізбелік он бес күн ішінде шарттың талаптарына ұсынылған өзгерістерді қарайды және Қарыз алушыға жазбаша нысанда не шартта көзделген тәсілмен:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- шарт талаптарына ұсынылған өзгерістермен келіскенде;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- берешекті реттеу жөніндегі өз ұсыныстары бойынша;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- бас тарту себептерінің дәлелді негіздемесін көрсете отырып, Шарт талаптарын өзгертуден бас тарқаны жайлы; хабарлайды.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6.4. Қарыз алушы МҚҰ шешімін алған күннен бастап күнтізбелік он бес күн ішінде немесе шарттың талаптарын өзгерту туралы өзара қолайлы шешімге қол жеткізілмеген кезде МҚҰ-ны бір мезгілде хабардар ете отырып, уәкілетті органға жүгінуге құқылы.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '6.5. Қарыз алушының өтінішін қарау нәтижелері бойынша берешекті реттеу жөнінде келісімге қол жеткізілмеген және Қарыз алушы берешек бойынша қарсылықтарды ұсынбаған жағдайда, МҚҰ:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- Қарыз алушыға қатысты шаралар қолдану туралы мәселені қарауға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- берешекті сотқа дейін өндіріп алуға және реттеуге коллекторлық агенттікке беруге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- Қарыз алушының келісімін алмай, нотариустың атқарушылық жазбасы негізінде негізгі борышты, сыйақыны және тұрақсыздық айыбын, мерзімі өткен сыйақыны қоса алғанда, берешекті өндіріп алуға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '7. Атқарушылық жазба',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: '7.1. Қарыз алушы, МҚҰ-ның негізгі борыш сомасын, сыйақы сомасын, тұрақсыздық айыбы, мерзімі өткен сыйақы сомасын даусыз тәртіппен өндіріп алу құқығымен орындау мерзімі басталған осы Шартта көзделген міндеттемелерді орындамаған жағдайда, Қарыз алушы МҚҰ-ның атқару жазбасын жасау үшін нотариусқа жүгіну құқығы жайлы хабардар және онымен келіседі.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'Қарыз алушы Шарттың осы тармағының ережелері Қарыз алушының осы Шарт бойынша МҚҰ/өндіріп алушы алдындағы борышкер ретіндегі өзінің даусыз жауапкершілігін тану туралы келісімі болып табылатынын растайды және мойындайды (бұл сондай-ақ дауды сотқа дейін реттеу тәртібімен шағымға жауап және орындалмаған міндеттемеде борышкердің кінәсін жазбаша мойындауына теңестіріледі).',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '7.2. Қарыз алушы МҚҰ/Өндіріп алушының өтініші негізінде МҚҰ/ Өндіріп алушының таңдауы бойынша:',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- Қарыз алушының тіркелген жері;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- Қарыз алушының шартта және сауалнамада көрсетілген мекен-жайы;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '- Өндіріп алушының/МҚҰ және/немесе Қарыз алушының тұрғылықты жеріне, орналасқан жеріне немесе тіркелген жеріне қарамастан, Қазақстан Республикасының кез келген нотариусының орналасқан мекенжайы;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'бойынша нотариустың атқарушылық жазбаны жасауына келісім береді.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8. Қарыз алушы шартсыз және қайтарып алынбайтын:',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: '8.1. МҚҰ пайдасына (рекурренттік төлемдерді қолдану) Автоматты төлем (төлемдер)арқылы банк картасының шотынан ақша қаражатын есептен шығаруға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8.2. дербес деректермен жинауды, өңдеуді, жазуды, көшіруді, резервтік көшіруді, қорғауды, скринингті, жүйелеуді, жинақтауды, сақтауды қоса алғанда, бірақ онымен шектелмей, автоматтандыру құралдарын пайдалана отырып немесе соңғысын пайдаланбай жасалатын кез келген әрекетті (операцияны) немесе осындай әрекеттердің (операциялардың) жиынтығын жүзеге асыруға келісім береді МҚҰ ішінде және одан тыс жерлерде нақтылау (өзгерту, жаңарту), алып қою, пайдалану, беру (тарату, рұқсат беру, оның ішінде субъектінің дербес деректерін өңдеу құқығымен үшінші тұлғаларға беру), соның ішінде трансшекаралық беру), иесіздендіру, бұғаттау, жою, жою, оның ішінде осы іс-әрекеттерді МҚҰ тапсырмасы бойынша үшінші тұлғаның жүзеге асыруға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8.3. МҚҰ-ға ол туралы ақпаратты мемлекеттік дерекқорды қоса алғанда, кез келген ықтимал көздерден алуға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8.4. Қарыз алушы шарт бойынша міндеттемелерін орындамаған / тиісінше орындамаған жағдайда, МҚҰ-ға шарт бойынша өз құқықтарын іске асыру үшін қажетті кез келген үшінші тұлғаларға МҚҰ-ның кез келген ақпаратты ашуына және беруіне, оның ішінде Қарыз алушының МҚҰ алдындағы берешегінің мөлшері туралы, шарт талаптарының бұзылуынан туындаған қойылған және болашақта қойылатын талаптар мен талаптардың сипаты туралы ақпаратты қоса алғанда, сондай-ақ МҚҰ-ның бұл туралы үшінші тұлғаларға телефон қоңыраулары, телефонограмма, автоматтандырылған телефония, SMS түріндегі хабарламалар, кез келген мессенджерлер арқылы немесе жазбаша хабарлама арқылы хабарлауға, Қарыз алушының жұмыс орны бойынша хабарламаларды қоса алғанда және өзге де тәсілдермен хабарлауға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8.5. МҚҰ-ға Қарыз алушының осы шарттың талаптарын орындауын бақылау мақсатында Қарыз алушымен сөйлесулердің аудиожазбасын жүргізуге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '8.6. шарт бойынша талап ету құқықтарын үшінші тұлғаларға басқаға беруге;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'МҚҰ-дан жарнамалық материалдар мен МҚҰ қызметтері мен акциялары туралы ақпарат алуға;',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9. Шарт талаптарына өзгерістер енгізу тәртібі және өзге де талаптар',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9.1. Шарттың талаптарын өзгерту Тараптар арасында шартқа тиісті келісім жасалған жағдайда орын алуы мүмкін.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9.2. Шарттың талаптары оларды жақсарту жағына қарай өзгерген кезде Қарыз алушы үшін қосымша келісім жасалмайды.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9.3. Шарт мемлекеттік және орыс тілдерінде жасалды. Шарттың мемлекеттік және орыс нұсқалары арасында әртүрлі оқылулар болған жағдайда, шарттың орыс тілінде жасалған нұсқасы басымдыққа ие болады.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9.4. Осы Шарттың жарамсыз бөлігін тану оның басқа бөліктерінің және тұтастай шарттың жарамсыздығына әкеп соқпайды.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9.5. Осы Шарт бойынша барлық хат алмасу орыс тілінде жүргізіледі.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9.6. Осы Шартта көзделмеген барлық қалған жағдайларда Тараптар www.i-credit.kz. интернет-ресурста орналастырылған микрокредиттер беру қағидаларын басшылыққа алады.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '9.7. Осы Шартқа қол қою арқылы Қарыз алушы МҚҰ-ның ресми сайтында орналастырылған микрокредиттер беру қағидаларымен танысқанын және келісетінін растайды: www.i-credit.kz.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '10. Төрелік ескертпе',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '10.1. Осы Шарттан туындайтын немесе оған байланысты шарттық немесе шарттан тыс сипаттағы кез келген дау, келіспеушілік, қайшылық немесе талап ету, оның ішінде оның бар болуына, шындыққа, түсіндірілуіне, орындалуына, бұзылуына немесе тоқтатылуына қатысты даулар "АВАЛЬ" Халықаралық төрелік сотының қарауына беріледі және  "АВАЛЬ" Халықаралық төрелік соты, оның орналасқан жері бойынша жүргізетін төрелік талқылау шеңберінде, оның Регламентіне сәйкес бір төреші құрамында, түпкілікті шешіледі.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '10.2. АВАЛЬ" Халықаралық төрелік сотының шешімі түпкілікті және тараптар үшін міндетті болып табылады.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: '10.3. Тараптар осы бөлімде көрсетілгендер жазбаша нысанда жасалған төрелік келісім болып табылатынын растайды.',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'ТАРАПТАРДЫҢ ДЕРЕКТЕМЕЛЕРІ:',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true
                  },
                  {
                    text: 'Қарыз беруші:',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true,
                    italics: true
                  },
                  {
                    text: '«МФО «I-CREDIT.KZ»ЖШС',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'БСН 070440003902',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'ЖСК KZ976017131000000372',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'АО "Народный Банк Казахстана"',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'БСК HSBKKZKX',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'МО',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: ' ',
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: 'Қарыз алушы:',
                    fontSize: 12,
                    alignment: 'justify',
                    bold: true,
                    italics: true
                  },
                  {
                    text: `Т.А.Ә.а. ${props.fio}`,
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: `ЖСН ${props.iin}`,
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: `жеке куәлік № ${props.cardNumber}`,
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: `берілді ${props.cardGiven} ${props.startCard}ж.`,
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: `мекен жайы: ${props.address}`,
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: `ұ/тел:  ${props.phone}`,
                    fontSize: 12,
                    alignment: 'justify'
                  },
                  {
                    text: `e-mail:${props.email}`,
                    fontSize: 12,
                    alignment: 'justify'
                  },
                ]
              }
            ]
          ]
        }
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        stack: [
          {
            text: `Приложение к договору №${props.contractNumber} от ${props.givenDate}г./`,
            fontSize: 12,
            alignment: 'right'
          },
          {
            text: `${props.givenDate}ж. №${props.contractNumber} Шартқа қосымша`,
            fontSize: 12,
            alignment: 'right'
          }
        ]
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      
      {
        stack: [
          {
            text: 'ГРАФИК ПОГАШЕНИЯ /',
            fontSize: 12,
            bold: true,
            alignment: 'center'
          },
          {
            text: 'ӨТЕУ КЕСТЕСІ',
            fontSize: 12,
            bold: true,
            alignment: 'center'
          }
        ]
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        table: {
          body: [
            [
              {
                rowSpan: 2,
                text: 'Общая сумма к погашению/ өтеуге жататын жалпы сома',
                fontSize: 12,
                alignment: 'center'
              },
              {
                colSpan: 2,
                text: 'в том числе',
                fontSize: 12,
                alignment: 'center'
              },
              {
                text: ''
              },
              {
                text: 'Дата возврата/ қайтару күні',
                fontSize: 12,
                alignment: 'center'
              }
            ],
            [
              {
                text: ''
              },
              {
                text: 'Основной долг/ Негізгі қарыз',
                fontSize: 12,
                alignment: 'center'
              },
              {
                text: 'Вознаграждение/ Сыйақы',
                fontSize: 12,
                alignment: 'center'
              },
              {
                text: ' ',
              }
            ],
            [
              {
                text: `${props.total}`,
                fontSize: 12,
                alignment: 'center'
              },
  
              {
                text: `${props.main}`,
                fontSize: 12,
                alignment: 'center'
              },
              {
                text: `${props.reward}`,
                fontSize: 12,
                alignment: 'center'
              },
              {
                text: `${props.endDate}`,
                fontSize: 12,
                alignment: 'center'
              },
            ]
          ]
        }
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: ' '
      },
      {
        text: 'Реквизиты сторон/ Тараптардың деректемелері',
        fontSize: 12,
        bold: true,
        alignment: 'center'
      },
      {
        text: ' '
      },
      {
        table: {
          widths: ['*', '*'],
          body: [
            [
              {
                text: 'Займодатель/Қарыз беруші',
                fontSize: 12,
                bold: true,
                alignment: 'center'
              },
              {
                text: 'Заемщик/ Қарыз алушы',
                fontSize: 12,
                bold: true,
                alignment: 'center'
              }
            ],
            [
              {
                stack: [
                  {
                    text: 'ТОО/ЖШС «МФО «I-CREDIT.KZ»',
                    fontSize: 12,
                  },
                  {
                    text: 'БИН/БСН 070440003902',
                    fontSize: 12,
                  },
                  {
                    text: 'ИИК/ЖСК KZ976017131000000372',
                    fontSize: 12,
                  },
                  {
                    text: 'АО "Народный Банк Казахстана"',
                    fontSize: 12,
                  },
                  {
                    text: 'БИК/БСК HSBKKZKX',
                    fontSize: 12,
                  },
                ]
              },
              {
                stack: [
                  {
                    text: `ФИО/Т.А.Ә.а. ${props.fio}`,
                    fontSize: 12,
                  },
                  {
                    text: `ИИН/ЖСН ${props.iin}`,
                    fontSize: 12,
                  },
                  {
                    text: `удостоверение личности/жеке куәлік ${props.cardNumber}`,
                    fontSize: 12,
                  },
                  {
                    text: `выдано/берілді ${props.cardGiven} ${props.startCard}`,
                    fontSize: 12,
                  },
                  {
                    text: `адрес/мекен жайы: ${props.address}`,
                    fontSize: 12,
                  },
                  {
                    text: `тел: ${props.phone}`,
                    fontSize: 12,
                  },
                  {
                    text: `e-mail: ${props.email}`,
                    fontSize: 12,
                  },
                ]
              }
            ]
          ]
        }
      }
    ],
    defaultStyle: {
      font: 'TimesNewRoman',
    },
  }
  return (
    <li>
      <a onClick={() => pdfMake.createPdf(restructuringAgreement).open()}>
        5. Договор реструктуризации долга
      </a>
    </li>
  )
}

export default RestructuringAgreementDocument

