import Head from "next/head"

const DifficultyRepayment = () => {
  return (
    <div className="bottom-banner--text" style={{margin: 0, paddingTop: "100px"}}>
      <Head>
        <title>Порядок урегулирования задолженности</title>
      </Head>
      <p className="container">
      <br/>
            ТОО «МФО «I-CREDIT.KZ» (далее – МФО) идя навстречу заемщикам, которые испытывают сложности с погашением микрокредитов в результате ухудшения финансового состояния, сообщает о предоставлении возможности урегулирования просроченной задолженности по договору о предоставлении микрокредита.
            Для урегулирования задолженности необходимо подать заявление, составленное в произвольной форме, содержащее сведения о причинах возникновения просрочки исполнения обязательства по договору с приложением документов, подтверждающих ухудшение финансового состояния.
            <br/>
            Документы необходимо отсканировать и отправить на электронный адрес: info@i-credit.kz
            <br/>
            Каждое заявление будет рассмотрено в индивидуальном порядке  в течение 15 дней.
            По результатам рассмотрения заявки на е-mail заемщикa будет выслано уведомление с решением МФО. 
            <br/>
            Дополнительную информацию можно получить по телефонам: 8 (727) 2501-500, 7 700 750 15 00 либо в отделе взыскания 7 778 870 10 29.
      </p>
    </div>
  )
}

export default DifficultyRepayment